In [5]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "name":['harry','rohan','subh','ram'],
    "marks":[92 , 34, 24, 17],
    "city":['rampur','gaya','kolkata','kodarma']
}

In [7]:
df=pd.DataFrame(dict1)

In [4]:
df

    name  marks     city
0  harry     92   rampur
1  rohan     34     gaya
2   subh     24  kolkata
3    ram     17  kodarma

In [5]:
df.to_csv('friends.csv')

In [1]:
df.head(2)

NameError: name 'df' is not defined

In [2]:
df.to_csv('friends_index',index = false)

NameError: name 'df' is not defined

In [3]:
df

NameError: name 'df' is not defined

In [4]:
df=pd.DataFrame(Dict1)

NameError: name 'pd' is not defined

In [8]:
df

    name  marks     city
0  harry     92   rampur
1  rohan     34     gaya
2   subh     24  kolkata
3    ram     17  kodarma

In [9]:
df.to_csv('friends_index.csv',index = false)

NameError: name 'false' is not defined

In [10]:
df.to_csv('friends_index.csv',index = False)

In [11]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     34    gaya

In [12]:
df.tail(2)

   name  marks     city
2  subh     24  kolkata
3   ram     17  kodarma

In [13]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [ ]:
harry = pd.read_csv('harry.csv')